function setup() {
  createCanvas(400, 600);
}
function draw() {
  background(8, 55, 160);
  // 1. 바다를 상징하는 배경
  noStroke();
  fill(255, 255, 220, 30);
  triangle(0, 0, 130, 600, 0, 600);
  fill(255, 255, 255, 25);
  quad(0, 0, 260, 600, 400, 600, 70, 0);
  fill(0, 255, 220, 22);
  quad(120, 0, 320, 600, 400, 600, 220, 0);
  fill(255, 170, 70, 18);
  triangle(400, 0, 400, 250, 240, 0);
  // 2. 햇빛이 인해 바다에 비치는 모습
  noStroke();
  fill(0, 210, 190, 210);
  ellipse(48, 70, 90, 90);
  fill(255, 130, 20, 200);
  ellipse(82, 102, 66, 66);
  fill(15, 35, 110, 220);
  ellipse(35, 130, 96, 96);
  fill(255, 255, 255, 70);
  ellipse(60, 92, 38, 38);
  fill(255, 240, 210, 40);
  ellipse(55, 95, 135, 135);
  // 3. 바다의 물고기들
  fill(255, 255, 255, 150);
  ellipse(145, 325, 220, 220);
  fill(160, 235, 255, 80);
  ellipse(145, 325, 270, 270);
  fill(10, 45, 145, 190);
  ellipse(255, 438, 260, 260);
  fill(0, 220, 200, 75);
  ellipse(255, 438, 305, 305);
  fill(255, 110, 10, 210);
  arc(200, 395, 112, 112, 0, PI);
  fill(0, 235, 205, 190);
  arc(200, 395, 112, 112, PI, TWO_PI);
  fill(255, 250, 230, 95);
  ellipse(200, 395, 48, 48);
  fill(255, 180, 80, 45);
  ellipse(200, 395, 170, 170);
  // 4.인공적이고 차가운 느낌을 주는 도형. 바다의 쓰레기를 상징
  stroke(255, 245, 210, 180);
  strokeWeight(2);
  fill(6, 22, 85, 235);
  rect(278, 235, 105, 105);
  noStroke();
  fill(0, 210, 185, 220);
  arc(330, 287, 84, 84, HALF_PI, PI + HALF_PI);
  fill(255, 115, 10, 220);
  arc(330, 287, 84, 84, PI + HALF_PI, HALF_PI);
  fill(255, 255, 255, 75);
  ellipse(330, 287, 28, 28);
  fill(255, 240, 210, 30);
  ellipse(330, 287, 120, 120);
  stroke(255, 245, 210, 160);
  strokeWeight(1.5);
  fill(8, 24, 90, 235);
  rect(302, 452, 82, 82);
  noStroke();
  fill(255, 255, 255, 220);
  ellipse(343, 493, 42, 42);
  fill(10, 80, 200, 220);
  triangle(322, 473, 364, 473, 343, 513);
  fill(0, 220, 200, 60);
  ellipse(343, 493, 70, 70);
  // 5. 물방울
  noStroke();
  fill(255, 200, 120, 120);
  ellipse(300, 115, 20, 20);
  fill(0, 230, 210, 110);
  ellipse(340, 145, 14, 14);
  fill(255, 255, 255, 100);
  ellipse(310, 175, 10, 10);
  fill(255, 170, 60, 95);
  ellipse(92, 235, 12, 12);
  fill(0, 230, 210, 90);
  ellipse(118, 258, 9, 9);
  // 6. 바다에서 보이는 햇빛
  stroke(0, 255, 220, 70);
  line(35, 130, 330, 287);
  stroke(255, 140, 40, 70);
  line(82, 102, 343, 493);
}
